app/Http/Controllers/Accounting/Invoice_cont.php

select * from `invoices` where `invoices`.`deleted_at` is null
---
    public function index($type ,Request $request)
    {
        if (!self::permision('Invoice_View')) {
            $request->session()->flash('alert-danger', __('lang.You_dont_have_permision'));
            return redirect()->back();
        }
        if ($type == 'Del')
            $invoice = Invoice::onlyTrashed()->get();
        else
            $invoice = Invoice::all()->sortByDesc('created_at');

select * from `customers` where (`company` like 'd%' or `name` like 'd%') and `customers`.`deleted_at` is null
---
    public function csearch(Request $request)
    {
        $result = array();
        $out = array();
        $name = $request->input('keyword');
        if ($name) {
            $result=Customer::where('company','like',$name.'%')->orWhere('name','like',$name.'%')->get();

select * from `invoices`
select * from `customers` where `customers`.`deleted_at` is null
---
            $request->session()->flash('alert-success', __('Invoice was successful added!'));
            return redirect()->back();
        } else {
            $lastinvoice = Invoice::withTrashed()->get()->count() == 0 ? 1000 : Invoice::withTrashed()->get()->max('tid');;
            $arr['customers'] = Customer::all();

select * from `departments` where `departments`.`id` = '2' and `departments`.`deleted_at` is null limit 1
select * from `divisions` where `divisions`.`id` = '2' and `divisions`.`deleted_at` is null limit 1
select * from `groups` where `groups`.`id` = '3' and `groups`.`deleted_at` is null limit 1
---
    public static function invpermision( $ob,$Type)
    {
        if(is_null($ob)){
            return false;
        }
        if (!Auth::user()){
            return redirect(route('login'));
        }
        if(Auth::user()->hasAnyRole(['Admin']) )
            return true;
        $Departmentname = $ob->Group->Division->Department->name;