app/Http/Controllers/Admin/Customer_cont.php

            $request->session()->flash('alert-success', __('User was successful added!').' Temporary Password is ' . $temp_password  );
            return redirect()->back();
        }else{
            $groups=Group::all();
            $arr['groups']=$groups;
            $roles = Role::where('guard_name','customer')->get();
---
select * from `groups` where `groups`.`deleted_at` is null
select * from `roles` where `guard_name` = 'customer'

    public static function permision( $ob,$Type)
    {
        if (!Auth::user()){
            return redirect(route('login'));
        }
        if(is_null($ob))
        {
            if(Auth::user()->hasAnyRole(['Admin']) ||
                Auth::user()->hasAnyPermission([
                    $Type
                ]) )   {
                return true;
            }else{
                return false;
            }
        }else{
            if(Auth::user()->hasAnyRole(['Admin']))
                return true;
         $Departmentname = $ob->Group->Division->Department->name;
---
select * from `departments` where `departments`.`id` = '6' and `departments`.`deleted_at` is null limit 1
select * from `divisions` where `divisions`.`id` = '3' and `divisions`.`deleted_at` is null limit 1
select * from `groups` where `groups`.`id` = '9' and `groups`.`deleted_at` is null limit 1