app/Http/Controllers/Admin/Dashboard_cont.php

    public function index()
    {
        if (!Auth::user()) {
            return redirect(route('login'));
        }
        $user = Auth::user();
        if ($user->hasAnyPermission(['Only_My_Customers'])) {
            $Invoices=array();
        } else {
            $Invoices = Invoice::all()->sortByDesc('created_at');
        }
        if ($user->hasAnyPermission(['Only_My_Customers'])) {
            $customers = Customer::where('user_id', $user->id)->get();
        } else
            $customers = Customer::where('created_at', '>=', date(\Carbon\Carbon::today()->subDays(15)))->get();
        if (Auth::user()->hasAnyRole(['Admin'])) {
            $countTasks = Task::all()->count();
            $dataWithAllTasks = Task::all()->sortByDesc('created_at')->where('state_id', '<>', 5)->take(9);
            $completedTasks = Task::where('state_id', 5)->get()->count();
        } else {

            $countTasks = Task::where('Department_id', Auth::user()->Department->id)->count();
            //dd(Auth::user()->Department->id);
            $dataWithAllTasks = Task::where('Department_id', Auth::user()->Department->id)->where('state_id', '<>', 5)->get()->take(7);
            // dd($dataWithAllTasks);
            $completedTasks = Task::where('state_id', 5)->where('Department_id', Auth::user()->Department->id)->get()->count();
---
select * from `invoices` where `invoices`.`deleted_at` is null
select * from `customers` where `created_at` >= '2019-10-01 00:00:00' and `customers`.`deleted_at` is null
select * from `tasks` where `state_id` = 5 and `tasks`.`deleted_at` is null
select count(*) as aggregate from `tasks` where `Department_id` = 2 and `tasks`.`deleted_at` is null
select * from `tasks` where `Department_id` = 2 and `state_id` <> 5 and `tasks`.`deleted_at` is null
select * from `tasks` where `state_id` = 5 and `Department_id` = 2 and `tasks`.`deleted_at` is null

        $arr['dataWithAllTasks'] = $dataWithAllTasks;
        $arr['Invoices'] = $Invoices;
        $arr['customers'] = $customers;
        $Income = Transaction::where('type', 'Income')->sum('amount');
        $Payment = Transaction::where('type', 'Expense')->sum('amount');
        $Expense = Expense::all()->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where `type` = 'Income'
select sum(`amount`) as aggregate from `transactions` where `type` = 'Expense'
select * from `expenses` where `expenses`.`deleted_at` is null

        $arr['Expenses'] = $Expense;
        $arr['Payment'] = $Payment;

        $arr['D_Expenses'] = Expense::where('date', '>=', \Carbon\Carbon::today()->toDateString())->sum('amount');
        $arr['M_Expenses'] = Expense::where('date', '>=', Carbon::now()->subDays(30)->toDateString())->sum('amount');

        $arr['D_Payment'] = Transaction::where(
            function ($query) {
                $query->where('type', 'Expense');
            })->where('date', '>=', \Carbon\Carbon::today()->toDateString())->sum('amount');
        $arr['M_Payment'] = Transaction::where(
            function ($query) {
                $query->where('type', 'Expense');
            })->where('date', '>=', Carbon::now()->subDays(30)->toDateString())->sum('amount');;

        $arr['D_Income'] = Transaction::where(
            function ($query) {
                $query->where('type', 'Income');
            })->where('date', '>=', \Carbon\Carbon::today()->toDateString())->sum('amount');
        $arr['M_Income'] = Transaction::where(
            function ($query) {
                $query->where('type', 'Income');
            })->where('date', '>=', Carbon::now()->subDays(30)->toDateString())->sum('amount');
---
select sum(`amount`) as aggregate from `expenses` where `date` >= '2019-10-16' and `expenses`.`deleted_at` is null
select sum(`amount`) as aggregate from `expenses` where `date` >= '2019-09-16' and `expenses`.`deleted_at` is null
select sum(`amount`) as aggregate from `transactions` where (`type` = 'Expense') and `date` >= '2019-10-16'
select sum(`amount`) as aggregate from `transactions` where (`type` = 'Expense') and `date` >= '2019-09-16'
select sum(`amount`) as aggregate from `transactions` where (`type` = 'Income') and `date` >= '2019-10-16'
select sum(`amount`) as aggregate from `transactions` where (`type` = 'Income') and `date` >= '2019-09-16'

    public static function getalert()
    {
        if (!Auth::user()) {
            return redirect(route('login'));
        }
        $user = Auth::user();
        $alerts = Msgafter::where('user_id', $user->id)->take(3)->get();
---
select * from `msgafters` where `user_id` = 13 limit 3

    public static function refersh()
    {
        if (!Auth::user()) {
            return redirect(route('login'));
        }
        $msgbefor = Msgbefore::all();
---
select * from `msgbefores`

    public static function gettask()
    {
        if (!Auth::user()) {
            return redirect(route('login'));
        }
        $user = Auth::user();
        $Tasks = Task::where('user_id', $user->id)->where('state_id', '<>', 5)->take(9)->get();
---
select * from `tasks` where `user_id` = 13 and `state_id` <> 5 and `tasks`.`deleted_at` is null limit 9