app/Http/Controllers/Admin/Ticket_cont.php

select * from `tickets` where `status` = 'waiting' and `tickets`.`deleted_at` is null
select * from `tickets` where `department_id` = 2 and `status` = 'waiting' and `tickets`.`deleted_at` is null
---
    public static function getuserticket(){
        $user=Auth::user();
        if($user->hasAnyRole(['Admin'])){
            $Ticket= Ticket::where('status','waiting')->get();
        }else
        {$Ticket= Ticket::where('department_id',$user->Department->id)->where('status','waiting')->get();}